import re


def f(x):
    if x == "":
        return "", ""
    if x[0] == "|" and x[2] == ">":
        stem_ending = x[1]
    else:
        stem_ending = None
    x = re.sub(r"\|[^>]+>", "", x)
    x = re.sub(r"<[^|]+\|", "", x)
    x = re.sub(r"\+", "", x)
    return x, stem_ending


PRIMARY_ACTIVE = {
    "1S": [
        f("ω"), f("|ά>ῶ<ω|"), f("|έ>ῶ<ω|"), f("|ό>ῶ<ω|"), f("|#>ῶ<ω|"),
        f("μι"), f("|α>η+μι"), f("|ε>η+μι"), f("|ο>ω+μι"),
    ],
    "2S": [
        f("εις"), f("|ά>ᾷ<ει|ς"), f("|έ>εῖ<ει|ς"), f("|ό>οῖ<ει|ς"), f("|#>εῖ<ει|ς"),
        f("|η>ῃ<ι|ς"), f("ς"), f("|α>η+ς"), f("|ε>η+ς"), f("|ο>ω+ς"),
    ],
    "3S": [
        f("ει"), f("|ά>ᾷ<ει|"), f("|έ>εῖ<ει|"), f("|ό>οῖ<ει|"), f("|#>εῖ<ει|"),
        f("|η>ῃ<ι|"), f("σι(ν)"), f("|α>η+σι(ν)"), f("|ε>η+σι(ν)"), f("|ο>ω+σι(ν)"),
        f("τι(ν)"),
    ],
    "1P": [
        f("ο+μεν"), f("|ά>ῶ<ο|+μεν"), f("|έ>οῦ<ο|+μεν"), f("|ό>οῦ<ο|+μεν"), f("|#>οῦ<ο|+μεν"),
        f("μεν"),
    ],
    "2P": [
        f("ε+τε"), f("|ά>ᾶ<ε|+τε"), f("|έ>εῖ<ε|+τε"), f("|ό>οῦ<ε|+τε"), f("|#>εῖ<ε|+τε"),
        f("τε"),
    ],
    "3P": [
        f("ου+σι(ν)"), f("|ά>ῶ<ου|+σι(ν)"), f("|έ>οῦ<ου|+σι(ν)"), f("|ό>οῦ<ου|+σι(ν)"), f("|#>οῦ<ου|+σι(ν)"),
        f("ασι(ν)"), f("|α>ᾶ<α|σι(ν)"), f("|ε>ᾶ<α|σι(ν)"),
    ],
}

PRIMARY_MIDDLE = {
    "1S": [
        f("ο+μαι"), f("|ά>ῶ<ο|+μαι"), f("|έ>οῦ<ο|+μαι"), f("|έ>έο<ο|+μαι"), f("|ό>οῦ<ο|+μαι"),
        f("μαι"),
    ],
    "2S": [
        f("ει"), f("ῃ"), f("ε+σαι"), f("|ά>ᾷ<ει|"), f("|ά>ᾶ<ε|+σαι"), f("|έ>εῖ<ει|"), f("|έ>ῇ<ῃ|"), f("|ό>οῖ<ει|"),
        f("σαι"), f("|α>ῃ<ῃ|"), f("|η>ῃ<ῃ|"),
    ],
    "3S": [
        f("ε+ται"), f("|ά>ᾶ<ε|+ται"), f("|έ>εῖ<ε|+ται"), f("|ό>οῦ<ε|+ται"), f("|#>εῖ<ε|+ται"),
        f("ται"),
    ],
    "1P": [
        f("ό+μεθα"), f("|α>ώ<ό|+μεθα"), f("|ε>ού<ό|+μεθα"), f("|ο>ού<ό|+μεθα"),
        f("μεθα"),
    ],
    "2P": [
        f("ε+σθε"), f("|ά>ᾶ<ε|+σθε"), f("|έ>εῖ<ε|+σθε"), f("|ό>οῦ<ε|+σθε"), f("|#>εῖ<ε|+σθε"),
        f("σθε"),
    ],
    "3P": [
        f("ο+νται"), f("|ά>ῶ<ο|+νται"), f("|έ>οῦ<ο|+νται"), f("|ό>οῦ<ο|+νται"), f("|#>οῦ<ο|+νται"),
        f("νται")
    ],
}

SECONDARY_ACTIVE = {
    "1S": [
        f("ο+ν"), f("|α>ω<ο|+ν"), f("|ε>ου<ο|+ν"), f("|ο>ου<ο|+ν"),
        f("ν"), f("|α>η+ν"), f("|ε>ει+ν"), f("|ε>η+ν"), f("|ο>ου+ν")
    ],
    "2S": [
        f("ε+ς"), f("|α>ᾱ<ε|+ς"), f("|ε>ει<ε|+ς"), f("|ο>ου<ε|+ς"),
        f("ς"), f("|α>η+ς"), f("|ε>ει+ς"), f("|ο>ου+ς"),
    ],
    "3S": [
        f("ε"), f("ε(ν)"), f("|α>ᾱ<ε|"), f("|ε>ει<ε|"), f("|ο>ου<ε|"),
        f(""), f("|α>η"), f("|ε>ει"), f("|ο>ου"), f("ν"),
    ],
    "1P": [
        f("ο+μεν"), f("|ά>ῶ<ο|+μεν"), f("|έ>οῦ<ο|+μεν"), f("|ό>οῦ<ο|+μεν"),
        f("μεν"),
    ],
    "2P": [
        f("ε+τε"), f("|ά>ᾶ<ε|+τε"), f("|έ>εῖ<ε|+τε"), f("|ό>οῦ<ε|+τε"),
        f("τε"),
    ],
    "3P": [
        f("ο+ν"), f("|α>ω<ο|+ν"), f("|ε>ου<ο|+ν"), f("|ο>ου<ο|+ν"),
        f("ο+σαν"), f("|ό>οῦ<ε|+σαν"),
        f("σαν"),
    ],
}

SECONDARY_MIDDLE = {
    "1S": [
        f("ό+μην"), f("|α>ώ<ό|+μην"), f("|ε>ού<ό|+μην"), f("|ο>ού<ό|+μην"),
        f("μην"),
    ],
    "2S": [
        f("ου"), f("|ά>ῶ<ου|"), f("|έ>οῦ<ου|"), f("|ό>οῦ<ου|"),
        f("σο"), f("σθα"),
    ],
    "3S": [
        f("ε+το"), f("|ά>ᾶ<ε|+το"), f("|έ>εῖ<ε|+το"), f("|ό>οῦ<ε|+το"),
        f("το"), f("ε+το")
    ],
    "1P": [
        f("ό+μεθα"), f("|α>ώ<ό|+μεθα"), f("|ε>ού<ό|+μεθα"), f("|ο>ού<ό|+μεθα"),
        f("μεθα"),
    ],
    "2P": [
        f("ε+σθε"), f("|ά>ᾶ<ε|+σθε"), f("|έ>εῖ<ε|+σθε"), f("|ό>οῦ<ε|+σθε"),
        f("σθε"),
    ],
    "3P": [
        f("ο+ντο"), f("|ά>ῶ<ο|+ντο"), f("|έ>οῦ<ο|+ντο"), f("|ό>οῦ<ο|+ντο"),
        f("ντο"),
    ],
}
