import re


def f(x):
    if x == "":
        return "", ""
    m = re.search(r"\|([^>]+)>", x)
    if m:
        stem_ending = m.group(1)
    else:
        stem_ending = None
    x = re.sub(r"\|[^>]+>", "", x)
    x = re.sub(r"<[^|]+\|", "", x)
    x = re.sub(r"\+", "", x)
    return x, stem_ending


def g(x, y):
    return [
        f(z.format(*x))
        for z in y
    ]


C0 = [
    "|!>+{0}", "|α!>η+{0}", "|ᾰ!>η+{0}", "|ε!>η+{0}", "|ο!>ω+{0}",
]

C1e = [
    "ε+{0}",
    "|α>ᾱ<ε|+{0}", "|ε>ει<ε|+{0}", "|ο>ου<ε|+{0}",  # @@@
    "|α>ά<έ|+{0}", "|ε>εί<έ|+{0}", "|ο>ού<έ|+{0}",  # @@@
    "|ά>ᾶ<ε|+{0}", "|έ>εῖ<ε|+{0}", "|ό>οῦ<ε|+{0}",  # @@@
    "|ή>ῆ<ε|+{0}",
    "|#>εῖ<ε|+{0}",
]

C1o = [
    "ο+{0}",
    "ό+{0}",
    "|α>ω<ο|+{0}", "|ε>ου<ο|+{0}", "|ο>ου<ο|+{0}",  # @@@
    "|α>ώ<ό|+{0}", "|ε>ού<ό|+{0}", "|ο>ού<ό|+{0}",  # @@@
    "|ά>ῶ<ο|+{0}", "|έ>οῦ<ο|+{0}", "|ό>οῦ<ο|+{0}",  # @@@
    "|η>ω<ο|+{0}",
    "|#>οῦ<ο|+{0}",
]

C2 = [
    "|!>+{0}",
    "|σ>σα+{0}", "|ξ>ξα+{0}", "|ψ>ψα+{0}",
    "|θ>θα+{0}",  # @@@
    "|κ>κα+{0}",
    "|λ>λα+{0}", "|ρ>ρα+{0}",
    "|μ>μα+{0}", "|ν>να+{0}",
    "|π>πα+{0}",  # @@@
]


PRIMARY_ACTIVE = {
    "1S": g(["μι"], C0) + [
        f("ω"), f("|ά>ῶ<ω|"), f("|έ>ῶ<ω|"), f("|ό>ῶ<ω|"), f("|#>ῶ<ω|"),
    ],
    "2S": g(["ς"], C0) + [
        f("εις"), f("|ά>ᾷ<ει|ς"), f("|έ>εῖ<ει|ς"), f("|ό>οῖ<ει|ς"), f("|#>εῖ<ει|ς"),
        f("|η>ῃ<ι|ς"),
    ],
    "3S": g(["σι(ν)"], C0) + [
        f("ει"), f("|ά>ᾷ<ει|"), f("|έ>εῖ<ει|"), f("|ό>οῖ<ει|"), f("|#>εῖ<ει|"), f("|η>ῃ<ι|"),
        f("|!>τι(ν)"),
    ],
    "1P": g(["μεν"], C1o + ["|!>{0}"]),
    "2P": g(["τε"], C1e + ["|!>{0}"]),
    "3P": [
        f("ου+σι(ν)"), f("|ά>ῶ<ου|+σι(ν)"), f("|έ>οῦ<ου|+σι(ν)"), f("|ό>οῦ<ου|+σι(ν)"), f("|#>οῦ<ου|+σι(ν)"),
        f("|!>ασι(ν)"), f("|α!>ᾶ<α|σι(ν)"), f("|ᾰ!>ᾶ<α|σι(ν)"), f("|ε!>ᾶ<α|σι(ν)"), f("|ε!>ου+σι(ν)"),
    ],
}

PRIMARY_MIDDLE = {
    "1S": g(["μαι"], [
        "ο+{0}",
        "|ά>ῶ<ο|+{0}", "|έ>οῦ<ο|+{0}", "|έ>έο<ο|+{0}", "|ό>οῦ<ο|+{0}",
        "|!>{0}",
    ]),
    "2S": [
        f("ει"),
        f("|ά>ᾷ<ει|"), f("|έ>εῖ<ει|"), f("|ό>οῖ<ει|"),
        f("ῃ"),
        f("|α!>ῃ<ῃ|"), f("|έ>ῇ<ῃ|"), f("|η!>ῃ<ῃ|"),
        f("ε+σαι"),
        f("|ά>ᾶ<ε|+σαι"),
        f("|!>σαι"),
    ],
    "3S": g(["ται"], C1e + ["|!>{0}"]),
    "1P": g(["μεθα"], C1o + ["|!>{0}"]),
    "2P": g(["σθε"], C1e + ["|!>{0}"]),
    "3P": g(["νται"], C1o + ["|!>{0}"]),
}


SECONDARY_ACTIVE = {
    "1S": g(["ν"], C1o + ["|!>+{0}", "|α!>η+{0}", "|ε!>ει+{0}", "|ε!>η+{0}", "|ο!>ου+{0}"]) + g([""], C2),
    "2S": g(["ς"], C1e + C2) + [
        f("|α!>η+ς"), f("|ε!>ει+ς"), f("|ο!>ου+ς"),
        f("|ειλ>εῖλες"),  # @@@
    ],
    "3S": g([""], C1e) + [
        f("ε(ν)"),
        f("|!>"), f("|η!>η"), f("|α!>η"), f("|ε!>ει"), f("|ο!>ου"), f("|!>ν"),
        f("|σ>σε(ν)"), f("|ψ>ψε(ν)"), f("|ξ>ξε(ν)"),
        f("|ειλ>εῖλε(ν)"),  # @@@
    ],
    "1P": g(["μεν"], C1o + C2),
    "2P": g(["τε"], C1e + C2),
    "3P": g(["ν"], C1o + C2) + [
        f("ο+σαν"), f("|ό>οῦ<ε|+σαν"),
        f("|!>σαν"),
        f("|ειλ>εῖλαν"),  # @@@
    ],
}


SECONDARY_MIDDLE = {
    "1S": g(["μην"], C1o + C2),
    "2S": [
        f("ου"), f("|ά>ῶ<ου|"), f("|έ>οῦ<ου|"), f("|ό>οῦ<ου|"),
        f("|ε!>ου<+σο|"), f("|ο!>ου<+σο|"),
        f("|!>σο"),
        f("|σ>σω"), f("|ξ>ξω"), f("|ψ>ψω"),
        f("|λ>λω"), f("|ρ>ρω"),
        f("|!>σθα"),  # @@@
    ],
    "3S": g(["το"], C1e + C2),
    "1P": g(["μεθα"], C1o + C2),
    "2P": g(["σθε"], C1e + C2),
    "3P": g(["ντο"], C1o + C2),
}


ACTIVE_SUBJUNCTIVE = {
    "1S": [
        f("ω"),
        f("|ά>ῶ"), f("|έ>ῶ"), f("|ό>ῶ"),
        f("|ά!>ῶ"), f("|έ!>ῶ"), f("|ό!>ῶ"),
        f("|ᾰ!>ῶ"),
        f("|η!>ῶ"), f("|ω!>ῶ"),
    ],
    "2S": [
        f("ῃς"),
        f("|ά>ᾷς"), f("|έ>ῇς"), f("|ό>οῖς"),
        f("|ό!>ῷς"), f("|έ!>ῇς"), f("|ά!>ῇς"),
        f("|ᾰ!>ῇς"),
        f("|η!>ῇς"), f("|ω!>ῷς"),
    ],
    "3S": [
        f("ῃ"),
        f("|ά>ᾷ"), f("|έ>ῇ"), f("|ό>οῖ"),
        f("|ε>εσῃ"),
        f("|ό!>ῷ"), f("|έ!>ῇ"), f("|ά!>ῇ"),
        f("|ᾰ!>ῇ"),
        f("|η!>ῇ"), f("|ω!>ῷ"),
        f("|ο!>οῖ"), f("|ω!>οῖ"), f("|ο!>ωῃ"), f("|ο!>ωσῃ")  # @@@
    ],
    "1P": g(["μεν"], [
        "ω+{0}",
        "|ά>ῶ+{0}", "|έ>ῶ+{0}", "|ό>ῶ+{0}",
        "|ό!>ῶ+{0}", "|έ!>ῶ+{0}", "|ά!>ῶ+{0}",
        "|ᾰ!>ῶ+{0}",
        "|η!>ῶ+{0}", "|ω!>ῶ+{0}",
    ]),
    "2P": g(["τε"], [
        "η+{0}",
        "|ά>ᾶ+{0}", "|έ>ῆ+{0}", "|ό>οῦ+{0}", "|ό>ῶ+{0}",
        "|ό!>ῶ+{0}", "|έ!>ῆ+{0}", "|ά!>ῆ+{0}",
        "|ω!>ῶ+{0}",
        "|ᾰ!>ῆ+{0}",
        "|η!>ῆ+{0}", "|η!>η+{0}",  # @@@
    ]),
    "3P": g(["σι(ν)"], [
        "ω+{0}",
        "|ά>ῶ+{0}", "|έ>ῶ+{0}", "|ό>ῶ+{0}",
        "|ό!>ῶ+{0}", "|έ!>ῶ+{0}", "|ά!>ῶ+{0}",
        "|ᾰ!>ῶ+{0}",
        "|η!>ῶ+{0}", "|ω!>ῶ+{0}",
    ]),
}


mosubj = [
    "ω+{0}",
    "|ά>ῶ+{0}", "|έ>ῶ+{0}", "|ό>ῶ+{0}",
    "|ά!>ῶ+{0}", "|έ!>ῶ+{0}", "|ό!>ῶ+{0}",
    "|ᾰ!>ῶ+{0}",
    "|α>ω+{0}", "|ε>ω+{0}", "|ο>ω+{0}",  # because of ώμεθα
    "|α!>ω+{0}", "|ε!>ω+{0}", "|ο!>ω+{0}",  # because of ώμεθα
]

mesubj = [
    "η+{0}",
    "|ά>ᾶ+{0}", "|έ>ῆ+{0}", "|ό>ῶ+{0}",
    "|ό!>ῶ+{0}", "|έ!>ῆ+{0}", "|ά!>ῆ+{0}",
    "|ᾰ!>ῆ+{0}",
]

MIDDLE_SUBJUNCTIVE = {
    "1S": g(["μαι"], mosubj),
    "2S": [
        f("ῃ"),
        f("|ά>ᾷ"), f("|έ>ῇ"), f("|ό>οῖ"),
        f("|ό!>ῷ"), f("|έ!>ῇ"), f("|ά!>ῇ"),
        f("|ᾰ!>ῇ"),
    ],
    "3S": g(["ται"], mesubj),
    "1P": g(["μεθα"], mosubj),
    "2P": g(["σθε"], mesubj),
    "3P": g(["νται"], mosubj),
}


PRIMARY_ACTIVE_OPTATIVE = {
    "1S": [
        f("οι+μι"),
        f("|ά>ῷ+μι"), f("|έ>οῖ+μι"), f("|ό>οῖ+μι"),
        f("|ά>ῴη+ν"), f("|ε>οιη+ν"), f("|ο>οιη+ν"),
        f("|!>ιη+ν"),
    ],
    "2S": [
        f("οι+ς"),
        f("|ά>ῷ+ς"), f("|έ>οῖ+ς"), f("|ό>οῖ+ς"),
        f("|ά>ῴη+ς"), f("|ε>οιη+ς"), f("|ο>οιη+ς"),
        f("|!>ιη+ς"),
    ],
    "3S": [
        f("οι"),
        f("|ά>ῷ"), f("|έ>οῖ"), f("|ό>οῖ"),
        f("|ά>ῴη"), f("|ε>οιη"), f("|ο>οιη"),
        f("|!>ιη"),
    ],
    "1P": [
        f("οι+μεν"),
        f("|ά>ῷ+μεν"), f("|έ>οῖ+μεν"), f("|ό>οῖ+μεν"),
        f("|ά>ῴη+μεν"), f("|έ>οιη+μεν"), f("|ο>οιη+μεν"),
        f("|!>ῖ+μεν"),
        f("|!>ιη+μεν"),
    ],
    "2P": [
        f("οι+τε"),
        f("|ά>ῷ+τε"), f("|έ>οῖ+τε"), f("|ό>οῖ+τε"),
        f("|ά>ῴη+τε"), f("|ε>οιη+τε"), f("|ο>οιη+τε"),
        f("|!>ῖ+τε"),
        f("|!>ιη+τε"),
    ],
    "3P": [
        f("οι+εν"), f("οι+ε(ν)"),
        f("|ά>ῷ+εν"), f("|έ>οῖ+εν"), f("|ό>οῖ+εν"),
        f("|ά>ῴη+σαν"), f("|ε>οιη+σαν"), f("|ο>οιη+σαν"),
        f("|!>ῖ+εν"),
        f("|!>ιη+σαν"),
    ],
}


Cpopt = [
    "οι+{0}",
    "|α>~ῳ+{0}", "|ε>~οι+{0}", "|ο>~οι+{0}",
    "|α!>~αι+{0}", "|ε!>~ει+{0}", "|ο!>~οι+{0}",
    "|α!>αι+{0}",  # @@@
]


PRIMARY_MIDDLE_OPTATIVE = {
    "1S": g(["μην"], Cpopt),
    "2S": g(["ο"], Cpopt),
    "3S": g(["το"], Cpopt),
    "1P": g(["μεθα"], Cpopt),
    "2P": g(["σθε"], Cpopt),
    "3P": g(["ντο"], Cpopt),
}


Copt = [
    "αι+{0}",
    "οι+{0}",
    "|α!>αι+{0}",
    "|η!>~ει+{0}",
    "|ε!>ει+{0}",
    "|ο!>οι+{0}",
    "|ο!>ῳ+{0}",
    "|ω!>οι+{0}",
]


SECONDARY_ACTIVE_OPTATIVE = {
    "1S": [
        f("αι+μι"),
    ] + g(["ην"], Copt),
    "2S": [
        f("αι+ς"),
        f("εια+ς"),
    ] + g(["ης"], Copt),
    "3S": [
        f("αι"),
        f("οι"),
        f("ειε"),
    ] + g(["η"], Copt),
    "1P": g(["μεν"], Copt) + g(["η+μεν"], Copt),
    "2P": g(["τε"], Copt) + g(["η+τε"], Copt),
    "3P": [
        f("αι+ε(ν)"),  # @@@
        f("οι+ε(ν)"),
        f("εια+ν"),
    ] + g(["εν"], Copt) + g(["η+σαν"], Copt),
}

SECONDARY_MIDDLE_OPTATIVE = {
    "1S": g(["μην"], Copt),
    "2S": g(["ο"], Copt),
    "3S": g(["το"], Copt),
    "1P": g(["μεθα"], Copt),
    "2P": g(["σθε"], Copt),
    "3P": g(["ντο"], Copt),
}


PRIMARY_ACTIVE_IMPERATIVE = {
    "2S": [
        f("ε"),
        f("|α>ᾱ"), f("|ε>ει"), f("|ο>ου"),
        f("|ο!>ου"), f("|ε!>ει"), f("|α!>η"), f("|ῡ!>ῡ"),
        f("|ᾰ!>η"),
    ],
    "3S": g(["τω"], [
        "ε+{0}",
        "|α>~α+{0}", "|ε>~ει+{0}", "|ο>~ου+{0}",
        "|!>+{0}",
    ]),
    "2P": g(["τε"], [
        "ε+{0}",
        "|α>~α+{0}", "|ε>~ει+{0}", "|ο>~ου+{0}",
        "|!>+{0}",
    ]),
    "3P": g(["ντων"], [
        "ο+{0}",
        "|α>ω+{0}", "|ε>ου+{0}", "|ο>ου+{0}",
        "|!>+{0}",
    ]) + g(["τωσαν"], [
        "ε+{0}",
        "|α>α+{0}", "|ε>ει+{0}",
    ]),
}

PRIMARY_MIDDLE_IMPERATIVE = {
    "2S": [
        f("ου"),
        f("|α>ῶ"), f("|ε>οῦ"), f("|ο>οῦ"),
        f("|!>+σο"), f("|η!>+ου"),
    ],
    "3S": g(["σθω"], [
        "ε+{0}",
        "|α>α+{0}", "|ε>ει+{0}", "|ο>ου+{0}",
        "|!>+{0}", "|οἰ!>οἰ+ε+{0}",
    ]),
    "2P": g(["σθε"], [
        "ε+{0}",
        "|α>ᾶ+{0}", "|ε>εῖ+{0}", "|ο>οῦ+{0}",
        "|!>+{0}", "|οἰ!>οἰ+ε+{0}",
    ]),
    "3P": g(["σθων"], [
        "ε+{0}",
        "|α>α+{0}", "|ε>ει+{0}", "|ο>ου+{0}",
        "|!>+{0}",
    ]) + g(["σθωσαν"], [
        "ε+{0}",
        "|α>α+{0}", "|ε>ει+{0}", "|ο>ου+{0}",
        "|!>+{0}",
    ]),
}

SECONDARY_ACTIVE_IMPERATIVE = {
    "2S": g(["ς"], ["|σ>σα+{0}", "|!>+{0}"]) + [
        f("ον"),
        f("|!>+τι"),
        f("|!>+θι"),
        f("ε"),
        f("|α>ᾱ<ε|"),  # @@@
    ],
    "3S": g(["τω"], C1e + C2),
    "2P": g(["τε"], C1e + C2),
    "3P": g(["τωσαν"], C1e + C2) + g(["ντων"], [
        "α+{0}",
        "|α!>α+{0}",
        "|η!>ε+{0}",
        "|ε!>ε+{0}",
        "|ο!>ο+{0}",
        "|ω!>ο+{0}",
    ]),
}

SECONDARY_MIDDLE_IMPERATIVE = {
    "2S": [
        f("|ε!>ου"),
        f("|ο!>ου"),
        f("οῦ"),  # @@@
        f("|σ>σαι"),
        f("|ξ>ξαι"),
        f("|ψ>ψαι"),
    ],
    "3S": g(["σθω"], C1e + C2),
    "2P": g(["σθε"], C1e + C2),
    "3P": g(["σθωσαν"], C2) + g(["σθων"], [
        "α+{0}",
        "|ε!>ε+{0}",
        "|ο!>ο+{0}",
    ]),
}


ACTIVE_INFINITIVE = [
    f("ειν"),
    f("~ειν"),
    f("|ε>~ειν"),

    f("|α>ᾶν"),  # @@@
    f("|ο>οῦν"),  # @@@
    f("|η>ῆν"),  # @@@
    f("|!>ναι"),
    f("|α!>άναι"),  # @@@
    f("|ῡ!>ύναι"),  # @@@
    f("|ο!>οῦναι"),  # @@@
    f("|ε!>εῖναι"),  # @@@
    f("|σ>σαι"),
    f("|ξ>ξαι"),
    f("|ψ>ψαι"),
    f("|κ>και"),
    f("|ρ>ραι"), f("|λ>λαι"),
    f("|ειν>εῖναι"),
]


MIDDLE_INFINITIVE = g(
    ["σθαι"], [
        "ε+{0}",
        "έ+{0}",  # @@@
        "|ά>ᾶ+{0}", "|έ>εῖ+{0}", "|ό>οῦ+{0}",
        "|!>{0}", "|ει!>εῖ+{0}", "|η!>ῆ+{0}", "|ε!>έ+{0}",  # @@@
        "|σ>σα+{0}",
        "|ξ>ξα+{0}", "|ψ>ψα+{0}",
        "|ρ>ρα+{0}", "|λ>λα+{0}",
    ]
)
