import re


def f(x):
    if x[0] == "|" and x[2] == ">":
        stem_ending = x[1]
    else:
        stem_ending = None
    x = re.sub(r"\|[^>]+>", "", x)
    x = re.sub(r"<[^|]+\|", "", x)
    x = re.sub(r"\+", "", x)
    return x, stem_ending


PRIMARY_ACTIVE = {
    "1S": f("ω"),
    "2S": f("εις"),
    "3S": f("ει"),
    "1P": f("ο+μεν"),
    "2P": f("ε+τε"),
    "3P": f("ου+σι(ν)"),
}

PRIMARY_ACTIVE_ALPHA = {
    "1S": f("|ά>ῶ<ω|"),
    "2S": f("|ά>ᾷ<ει|ς"),
    "3S": f("|ά>ᾷ<ει|"),
    "1P": f("|ά>ῶ<ο|+μεν"),
    "2P": f("|ά>ᾶ<ε|+τε"),
    "3P": f("|ά>ῶ<ου|+σι(ν)"),
}

PRIMARY_ACTIVE_EPSILON = {
    "1S": f("|έ>ῶ<ω|"),
    "2S": f("|έ>εῖ<ει|ς"),
    "3S": f("|έ>εῖ<ει|"),
    "1P": f("|έ>οῦ<ο|+μεν"),
    "2P": f("|έ>εῖ<ε|+τε"),
    "3P": f("|έ>οῦ<ου|+σι(ν)"),
}

PRIMARY_ACTIVE_OMICRON = {
    "1S": f("|ό>ῶ<ω|"),
    "2S": f("|ό>οῖ<ει|ς"),
    "3S": f("|ό>οῖ<ει|"),
    "1P": f("|ό>οῦ<ο|+μεν"),
    "2P": f("|ό>οῦ<ε|+τε"),
    "3P": f("|ό>οῦ<ου|+σι(ν)"),
}

PRIMARY_MIDDLE = {
    "1S": f("ο+μαι"),
    "2S": [f("ει"), f("ῃ"), f("ε+σαι")],
    "3S": f("ε+ται"),
    "1P": f("ό+μεθα"),
    "2P": f("ε+σθε"),
    "3P": f("ο+νται"),
}

PRIMARY_MIDDLE_ALPHA = {
    "1S": f("|ά>ῶ<ο|+μαι"),
    "2S": [f("|ά>ᾷ<ει|"), f("|ά>ᾶ<ε|+σαι")],
    "3S": f("|ά>ᾶ<ε|+ται"),
    "1P": f("|α>ώ<ό|+μεθα"),
    "2P": f("|ά>ᾶ<ε|+σθε"),
    "3P": f("|ά>ῶ<ο|+νται"),
}

PRIMARY_MIDDLE_EPSILON = {
    "1S": [f("|έ>οῦ<ο|+μαι"), f("|έ>έο<ο|+μαι")],
    "2S": [f("|έ>εῖ<ει|"), f("|έ>ῇ<ῃ|")],
    "3S": f("|έ>εῖ<ε|+ται"),
    "1P": f("|ε>ού<ό|+μεθα"),
    "2P": f("|έ>εῖ<ε|+σθε"),
    "3P": f("|έ>οῦ<ο|+νται"),
}

PRIMARY_MIDDLE_OMICRON = {
    "1S": f("|ό>οῦ<ο|+μαι"),
    "2S": f("|ό>οῖ<ει|"),
    "3S": f("|ό>οῦ<ε|+ται"),
    "1P": f("|ο>ού<ό|+μεθα"),
    "2P": f("|ό>οῦ<ε|+σθε"),
    "3P": f("|ό>οῦ<ο|+νται"),
}

SECONDARY_ACTIVE = {
    "1S": f("ο+ν"),
    "2S": f("ε+ς"),
    "3S": [f("ε"), f("ε(ν)")],
    "1P": f("ο+μεν"),
    "2P": f("ε+τε"),
    "3P": f("ον"),
}

SECONDARY_ACTIVE_ALPHA = {
    "1S": f("|α>ω<ο|+ν"),
    "2S": f("|α>ᾱ<ε|+ς"),
    "3S": f("|α>ᾱ<ε|"),
    "1P": f("|ά>ῶ<ο|+μεν"),
    "2P": f("|ά>ᾶ<ε|+τε"),
    "3P": f("|α>ω<ο|+ν"),
}

SECONDARY_ACTIVE_EPSILON = {
    "1S": f("|ε>ου<ο|+ν"),
    "2S": f("|ε>ει<ε|+ς"),
    "3S": f("|ε>ει<ε|"),
    "1P": f("|έ>οῦ<ο|+μεν"),
    "2P": f("|έ>εῖ<ε|+τε"),
    "3P": f("|ε>ου<ο|+ν"),
}

SECONDARY_ACTIVE_OMICRON = {
    "1S": f("|ο>ου<ο|+ν"),
    "2S": f("|ο>ου<ε|+ς"),
    "3S": f("|ο>ου<ε|"),
    "1P": f("|ό>οῦ<ο|+μεν"),
    "2P": f("|ό>οῦ<ε|+τε"),
    "3P": [f("|ο>ου<ο|+ν"), f("|ό>οῦ<ε|+σαν")]
}

SECONDARY_MIDDLE = {
    "1S": f("ό+μην"),
    "2S": f("ου"),  # ε+σο
    "3S": f("ε+το"),
    "1P": f("ό+μεθα"),
    "2P": f("ε+σθε"),
    "3P": f("ο+ντο"),
}

SECONDARY_MIDDLE_ALPHA = {
    "1S": f("|α>ώ<ό|+μην"),
    "2S": f("|ά>ῶ<ου|"),
    "3S": f("|ά>ᾶ<ε|+το"),
    "1P": f("|α>ώ<ό|+μεθα"),
    "2P": f("|ά>ᾶ<ε|+σθε"),
    "3P": f("|ά>ῶ<ο|+ντο"),
}

SECONDARY_MIDDLE_EPSILON = {
    "1S": f("|ε>ού<ό|+μην"),
    "2S": f("|έ>οῦ<ου|"),
    "3S": f("|έ>εῖ<ε|+το"),
    "1P": f("|ε>ού<ό|+μεθα"),
    "2P": f("|έ>εῖ<ε|+σθε"),
    "3P": f("|έ>οῦ<ο|+ντο"),
}

SECONDARY_MIDDLE_OMICRON = {
    "1S": f("|ο>ού<ό|+μην"),
    "2S": f("|ό>οῦ<ου|"),
    "3S": f("|ό>οῦ<ε|+το"),
    "1P": f("|ο>ού<ό|+μεθα"),
    "2P": f("|ό>οῦ<ε|+σθε"),
    "3P": f("|ό>οῦ<ο|+ντο"),
}
