import re


def f(x):
    if x == "":
        return "", ""
    m = re.search(r"\|([^>]+)>", x)
    if m:
        stem_ending = m.group(1)
    else:
        stem_ending = None
    x = re.sub(r"\|[^>]+>", "", x)
    x = re.sub(r"<[^|]+\|", "", x)
    x = re.sub(r"\+", "", x)
    return x, stem_ending


def g(x, y):
    return [
        f(z.format(*x))
        for z in y
    ]


C0 = [
    "|!>+{0}", "|α!>η+{0}", "|ᾰ!>η+{0}", "|ε!>η+{0}", "|ο!>ω+{0}",
]

C1e = [
    "ε+{0}",
    "|α>ᾱ<ε|+{0}", "|ε>ει<ε|+{0}", "|ο>ου<ε|+{0}",  # @@@
    "|α>ά<έ|+{0}", "|ε>εί<έ|+{0}", "|ο>ού<έ|+{0}",  # @@@
    "|ά>ᾶ<ε|+{0}", "|έ>εῖ<ε|+{0}", "|ό>οῦ<ε|+{0}",  # @@@
    "|ή>ῆ<ε|+{0}",
    "|#>εῖ<ε|+{0}",
]

C1o = [
    "ο+{0}",
    "ό+{0}",
    "|α>ω<ο|+{0}", "|ε>ου<ο|+{0}", "|ο>ου<ο|+{0}",  # @@@
    "|α>ώ<ό|+{0}", "|ε>ού<ό|+{0}", "|ο>ού<ό|+{0}",  # @@@
    "|ά>ῶ<ο|+{0}", "|έ>οῦ<ο|+{0}", "|ό>οῦ<ο|+{0}",  # @@@
    "|η>ω<ο|+{0}",
    "|#>οῦ<ο|+{0}",
]

C2 = [
    "|!>+{0}",
    "|σ>σα+{0}", "|ξ>ξα+{0}", "|ψ>ψα+{0}",
    "|θ>θα+{0}",  # @@@
    "|κ>κα+{0}",
    "|λ>λα+{0}", "|ρ>ρα+{0}",
    "|μ>μα+{0}", "|ν>να+{0}",
    "|π>πα+{0}",  # @@@
]


PRIMARY_ACTIVE = {
    "1S": g(["μι"], C0) + [
        f("ω"), f("|ά>ῶ<ω|"), f("|έ>ῶ<ω|"), f("|ό>ῶ<ω|"), f("|#>ῶ<ω|"),
    ],
    "2S": g(["ς"], C0) + [
        f("εις"), f("|ά>ᾷ<ει|ς"), f("|έ>εῖ<ει|ς"), f("|ό>οῖ<ει|ς"), f("|#>εῖ<ει|ς"),
        f("|η>ῃ<ι|ς"),
    ],
    "3S": g(["σι(ν)"], C0) + [
        f("ει"), f("|ά>ᾷ<ει|"), f("|έ>εῖ<ει|"), f("|ό>οῖ<ει|"), f("|#>εῖ<ει|"), f("|η>ῃ<ι|"),
        f("|!>τι(ν)"),
    ],
    "1P": g(["μεν"], C1o + ["|!>{0}"]),
    "2P": g(["τε"], C1e + ["|!>{0}"]),
    "3P": [
        f("ου+σι(ν)"), f("|ά>ῶ<ου|+σι(ν)"), f("|έ>οῦ<ου|+σι(ν)"), f("|ό>οῦ<ου|+σι(ν)"), f("|#>οῦ<ου|+σι(ν)"),
        f("|!>ασι(ν)"), f("|α!>ᾶ<α|σι(ν)"), f("|ᾰ!>ᾶ<α|σι(ν)"), f("|ε!>ᾶ<α|σι(ν)"), f("|ε!>ου+σι(ν)"),
    ],
}

PRIMARY_MIDDLE = {
    "1S": g(["μαι"], [
        "ο+{0}",
        "|ά>ῶ<ο|+{0}", "|έ>οῦ<ο|+{0}", "|έ>έο<ο|+{0}", "|ό>οῦ<ο|+{0}",
        "|!>{0}",
    ]),
    "2S": [
        f("ει"),
        f("|ά>ᾷ<ει|"), f("|έ>εῖ<ει|"), f("|ό>οῖ<ει|"),
        f("ῃ"),
        f("|α!>ῃ<ῃ|"), f("|έ>ῇ<ῃ|"), f("|η!>ῃ<ῃ|"),
        f("ε+σαι"),
        f("|ά>ᾶ<ε|+σαι"),
        f("|!>σαι"),
    ],
    "3S": g(["ται"], C1e + ["|!>{0}"]),
    "1P": g(["μεθα"], C1o + ["|!>{0}"]),
    "2P": g(["σθε"], C1e + ["|!>{0}"]),
    "3P": g(["νται"], C1o + ["|!>{0}"]),
}


SECONDARY_ACTIVE = {
    "1S": g(["ν"], C1o + ["|!>+{0}", "|α!>η+{0}", "|ε!>ει+{0}", "|ε!>η+{0}", "|ο!>ου+{0}"]) + g([""], C2),
    "2S": g(["ς"], C1e + C2) + [
        f("|α!>η+ς"), f("|ε!>ει+ς"), f("|ο!>ου+ς"),
        f("|ειλ>εῖλες"),  # @@@
    ],
    "3S": g([""], C1e) + [
        f("ε(ν)"),
        f("|!>"), f("|η!>η"), f("|α!>η"), f("|ε!>ει"), f("|ο!>ου"), f("|!>ν"),
        f("|σ>σε(ν)"), f("|ψ>ψε(ν)"), f("|ξ>ξε(ν)"),
        f("|ειλ>εῖλε(ν)"),  # @@@
    ],
    "1P": g(["μεν"], C1o + C2),
    "2P": g(["τε"], C1e + C2),
    "3P": g(["ν"], C1o + C2) + [
        f("ο+σαν"), f("|ό>οῦ<ε|+σαν"),
        f("|!>σαν"),
        f("|ειλ>εῖλαν"),  # @@@
    ],
}


SECONDARY_MIDDLE = {
    "1S": g(["μην"], C1o + C2),
    "2S": [
        f("ου"), f("|ά>ῶ<ου|"), f("|έ>οῦ<ου|"), f("|ό>οῦ<ου|"),
        f("|ε!>ου<+σο|"), f("|ο!>ου<+σο|"),
        f("|!>σο"),
        f("|σ>σω"), f("|ξ>ξω"), f("|ψ>ψω"),
        f("|λ>λω"), f("|ρ>ρω"),
        f("|!>σθα"),  # @@@
    ],
    "3S": g(["το"], C1e + C2),
    "1P": g(["μεθα"], C1o + C2),
    "2P": g(["σθε"], C1e + C2),
    "3P": g(["ντο"], C1o + C2),
}


ACTIVE_SUBJUNCTIVE = {
    "1S": [
        f("ω"),
        f("|ά>ῶ"), f("|έ>ῶ"), f("|ό>ῶ"),
        f("|ό!>ῶ"), f("|έ!>ῶ"), f("|ά!>ῶ"),
        f("|ᾰ!>ῶ"),
        f("|η!>ῶ"), f("|ω!>ῶ"),
    ],
    "2S": [
        f("ῃς"),
        f("|ά>ᾷς"), f("|έ>ῇς"), f("|ό>οῖς"),
        f("|ό!>ῷς"), f("|έ!>ῇς"), f("|ά!>ῇς"),
        f("|ᾰ!>ῇς"),
        f("|η!>ῇς"), f("|ω!>ῷς"),
    ],
    "3S": [
        f("ῃ"),
        f("|ά>ᾷ"), f("|έ>ῇ"), f("|ό>οῖ"),
        f("|ε>εσῃ"),
        f("|ό!>ῷ"), f("|έ!>ῇ"), f("|ά!>ῇ"),
        f("|ᾰ!>ῇ"),
        f("|η!>ῇ"), f("|ω!>ῷ"),
        f("|ο!>οῖ"), f("|ω!>οῖ"), f("|ο!>ωῃ"), f("|ο!>ωσῃ")  # @@@
    ],
    "1P": g(["μεν"], [
        "ω+{0}",
        "|ά>ῶ+{0}", "|έ>ῶ+{0}", "|ό>ῶ+{0}",
        "|ό!>ῶ+{0}", "|έ!>ῶ+{0}", "|ά!>ῶ+{0}",
        "|ᾰ!>ῶ+{0}",
        "|η!>ῶ+{0}",
    ]),
    "2P": g(["τε"], [
        "η+{0}",
        "|ά>ᾶ+{0}", "|έ>ῆ+{0}", "|ό>οῦ+{0}", "|ό>ῶ+{0}",
        "|ό!>ῶ+{0}", "|έ!>ῆ+{0}", "|ά!>ῆ+{0}",
        "|ω!>ῶ+{0}",
        "|ᾰ!>ῆ+{0}",
        "|η!>ῆ+{0}", "|η!>η+{0}",  # @@@
    ]),
    "3P": g(["σι(ν)"], [
        "ω+{0}",
        "|ά>ῶ+{0}", "|έ>ῶ+{0}", "|ό>ῶ+{0}",
        "|ό!>ῶ+{0}", "|έ!>ῶ+{0}", "|ά!>ῶ+{0}",
        "|ᾰ!>ῶ+{0}",
        "|η!>ῶ+{0}", "|ω!>ῶ+{0}",
    ]),
}


MIDDLE_SUBJUNCTIVE = {
    "1S": [
        f("ω+μαι"),
        f("|ά>ῶ+μαι"), f("|έ>ῶ+μαι"), f("|ό>ῶ+μαι"),
        f("|ό!>ῶ+μαι"), f("|έ!>ῶ+μαι"), f("|ά!>ῶ+μαι"),
        f("|ᾰ!>ῶ+μαι"),
    ],
    "2S": [
        f("ῃ"),
        f("|ά>ᾷ"), f("|έ>ῇ"), f("|ό>οῖ"),
        f("|ό!>ῷ"), f("|έ!>ῇ"), f("|ά!>ῇ"),
        f("|ᾰ!>ῇ"),
    ],
    "3S": [
        f("η+ται"),
        f("|ά>ᾶ+ται"), f("|έ>ῆ+ται"), f("|ό>ῶ+ται"),
        f("|ό!>ῶ+ται"), f("|έ!>ῆ+ται"), f("|ά!>ῆ+ται"),
        f("|ᾰ!>ῆ+ται"),
    ],
    "1P": [
        f("ω+μεθα"),
        f("|ά>ω+μεθα"), f("|έ>ω+μεθα"), f("|ό>ώ+μεθα"),
        f("|ό!>ώ+μεθα"), f("|έ!>ώ+μεθα"), f("|ά!>ώ+μεθα"),
        f("|ᾰ!>ώ+μεθα"),
    ],
    "2P": [
        f("η+σθε"),
        f("|ά>ᾶ+σθε"), f("|έ>ῆ+σθε"), f("|ό>ῶ+σθε"),
        f("|ό!>ῶ+σθε"), f("|έ!>ῆ+σθε"), f("|ά!>ῆ+σθε"),
        f("|ᾰ!>ῆ+σθε"),
    ],
    "3P": [
        f("ω+νται"),
        f("|ά>ῶ+νται"), f("|έ>ῶ+νται"), f("|ό>ῶ+νται"),
        f("|ό!>ῶ+νται"), f("|έ!>+ῶ+νται"), f("|ά!>ῶ+νται"),
        f("|ᾰ!>ῶ+νται"),
    ],
}


PRIMARY_ACTIVE_OPTATIVE = {
    "1S": [
        f("οι+μι"),
        f("|ά>ῷ+μι"), f("|έ>οῖ+μι"), f("|ό>οῖ+μι"),
        f("|ά>ῴη+ν"), f("|ε>οιη+ν"), f("|ο>οιη+ν"),
        f("|!>ιη+ν"),
    ],
    "2S": [
        f("οι+ς"),
        f("|ά>ῷ+ς"), f("|έ>οῖ+ς"), f("|ό>οῖ+ς"),
        f("|ά>ῴη+ς"), f("|ε>οιη+ς"), f("|ο>οιη+ς"),
        f("|!>ιη+ς"),
    ],
    "3S": [
        f("οι"),
        f("|ά>ῷ"), f("|έ>οῖ"), f("|ό>οῖ"),
        f("|ά>ῴη"), f("|ε>οιη"), f("|ο>οιη"),
        f("|!>ιη"),
    ],
    "1P": [
        f("οι+μεν"),
        f("|ά>ῷ+μεν"), f("|έ>οῖ+μεν"), f("|ό>οῖ+μεν"),
        f("|ά>ῴη+μεν"), f("|έ>οιη+μεν"), f("|ο>οιη+μεν"),
        f("|!>ῖ+μεν"),
        f("|!>ιη+μεν"),
    ],
    "2P": [
        f("οι+τε"),
        f("|ά>ῷ+τε"), f("|έ>οῖ+τε"), f("|ό>οῖ+τε"),
        f("|ά>ῴη+τε"), f("|ε>οιη+τε"), f("|ο>οιη+τε"),
        f("|!>ῖ+τε"),
        f("|!>ιη+τε"),
    ],
    "3P": [
        f("οι+εν"), f("οι+ε(ν)"),
        f("|ά>ῷ+εν"), f("|έ>οῖ+εν"), f("|ό>οῖ+εν"),
        f("|ά>ῴη+σαν"), f("|ε>οιη+σαν"), f("|ο>οιη+σαν"),
        f("|!>ῖ+εν"),
        f("|!>ιη+σαν"),
    ],
}


PRIMARY_MIDDLE_OPTATIVE = {
    "1S": [
        f("οι+μην"),
        f("|ά>ῴ+μην"), f("|ε>οι+μην"), f("|ο>οι+μην"),
        f("|!>ι+μην"),
    ],
    "2S": [
        f("οιο"),
        f("|ά>ῷο"), f("|έ>οῖο"), f("|ό>οῖο"),
        f("|!>ῖο"),
    ],
    "3S": [
        f("οι+το"),
        f("|ά>ῷ+το"), f("|έ>οῖ+το"), f("|ό>οῖ+το"),
        f("|!>ῖ+το"),
    ],
    "1P": [
        f("οι+μεθα"),
        f("|ά>ῴ+μεθα"), f("|ε>οι+μεθα"), f("|ο>οι+μεθα"),
        f("|!>ι+μεθα"),
    ],
    "2P": [
        f("οι+σθε"),
        f("|ά>ῷ+σθε"), f("|έ>οῖ+σθε"), f("|ό>οῖ+σθε"),
        f("|!>ῖ+σθε"),
    ],
    "3P": [
        f("οι+ντο"),
        f("|ά>ῷ+ντο"), f("|έ>οῖ+ντο"), f("|ό>οῖ+ντο"),
        f("|!>ῖ+ντο"), f("|!>ι+ντο"),
    ],
}


SECONDARY_ACTIVE_OPTATIVE = {
    "3S": [
        f("αι"),
        f("οι"),
        # f("|ά>ῷ"), f("|έ>οῖ"), f("|ό>οῖ"),
        # f("|ά>ῴη"), f("|ε>οιη"), f("|ο>οιη"),
        # f("|!>ιη"),
        f("|ο!>ῳη"),
        f("|η!>ειη"),
    ],
    "3P": [
        f("αιε(ν)"),
        f("οιε(ν)"),
        f("ειαν"),
    ],
}

SECONDARY_MIDDLE_OPTATIVE = {
    "1S": [f("αιμην")],
    "3S": [f("οιτο")],
}


PRIMARY_ACTIVE_IMPERATIVE = {
    "2S": [
        f("ε"),
        f("|α>ᾱ"), f("|ε>ει"), f("|ο>ου"),
        f("|ο!>ου"), f("|ε!>ει"), f("|α!>η"), f("|ῡ!>ῡ"),
        f("|ᾰ!>η"),
    ],
    "3S": [
        f("ε+τω"),
        f("|α>α+τω"), f("|ε>ει+τω"), f("|ο>ου+τω"),
        f("|!>+τω"),
    ],
    "2P": [
        f("ε+τε"),
        f("|α>ᾶ+τε"), f("|ε>εῖ+τε"), f("|ο>οῦ+τε"),
        f("|!>+τε"),
    ],
    "3P": [
        f("ο+ντων"),
        f("ε+τωσαν"),
        f("|α>ώ+ντων"), f("|ε>ου+ντων"), f("|ο>ου+ντων"),
        f("|α>α+τωσαν"), f("|ε>ει+τωσαν"),
        f("|!>+ντων"),
    ],
}

PRIMARY_MIDDLE_IMPERATIVE = {
    "2S": [
        f("ου"),
        f("|α>ῶ"), f("|ε>οῦ"), f("|ο>οῦ"),
        f("|!>+σο"), f("|η!>+ου"),
    ],
    "3S": [
        f("ε+σθω"),
        f("|α>α+σθω"), f("|ε>ει+σθω"), f("|ο>ου+σθω"),
        f("|!>+σθω"), f("|οἰ!>οἰ+ε+σθω"),
    ],
    "2P": [
        f("ε+σθε"),
        f("|α>ᾶ+σθε"), f("|ε>εῖ+σθε"), f("|ο>οῦ+σθε"),
        f("|!>+σθε"), f("|οἰ!>οἰ+ε+σθε"),
    ],
    "3P": [
        f("ε+σθων"),
        f("ε+σθωσαν"),
        f("|α>α+σθων"), f("|ε>ει+σθων"), f("|ο>ου+σθων"),
        f("|ε>ει+σθωσαν"), f("|ο>ου+σθωσαν"),
        f("|!>+σθων"),
        f("|!>+σθωσαν"),
    ],
}

SECONDARY_ACTIVE_IMPERATIVE = {
    "2S": g(["ς"], ["|σ>σα+{0}", "|!>+{0}"]) + [f("ον"), f("|!>+τι"), f("|!>+θι")] + [
        f("ε"), f("|α>α"),
    ],
    # "3S": g([""], C1e) + [
    #     f("ε(ν)"),
    #     f("|!>"), f("|η!>η"), f("|α!>η"), f("|ε!>ει"), f("|ο!>ου"), f("|!>ν"),
    #     f("|σ>σε(ν)"), f("|ψ>ψε(ν)"), f("|ξ>ξε(ν)"),
    #     f("|ειλ>εῖλε(ν)"),  # @@@
    # ],
    "3S": g(["τω"], C1e + C2),
    "2P": g(["τε"], C1e + C2),
    "3P": g(["τωσαν"], C1e + C2),
}

SECONDARY_MIDDLE_IMPERATIVE = {
    "2S": [
        f("οῦ"),
        f("|σ>σαι"),
        f("|ξ>ξαι"),
        f("|ψ>ψαι"),
    ],
    "3S": g(["σθω"], C1e + C2),
    "2P": g(["σθε"], C1e + C2),
    "3P": g(["σθωσαν"], C2),
}


ACTIVE_INFINITIVE = [
    f("ειν"),
    f("εῖν"),  # @@@
    f("|α>ᾶν"),  # @@@
    f("|ε>εῖν"),  # @@@
    f("|ο>οῦν"),  # @@@
    f("|η>ῆν"),  # @@@
    f("|!>ναι"),
    f("|α!>άναι"),  # @@@
    f("|ῡ!>ύναι"),  # @@@
    f("|ο!>οῦναι"),  # @@@
    f("|ε!>εῖναι"),  # @@@
    f("|σ>σαι"),
    f("|ισ>ίσαι"),  # @@@
    f("|ασ>άσαι"),  # @@@
    f("|ξ>ξαι"),
    f("|ψ>ψαι"),
    f("|κ>και"),
    f("|ρ>ραι"), f("|λ>λαι"),
    f("|αξ>άξαι"),  # @@@
    f("|αμψ>άμψαι"),  # @@@
    f("|υψ>ύψαι"),  # @@@
    f("|ειν>εῖναι"),
]


MIDDLE_INFINITIVE = g(
    ["σθαι"], [
        "ε+{0}",
        "έ+{0}",  # @@@
        "|ά>ᾶ+{0}", "|έ>εῖ+{0}", "|ό>οῦ+{0}",
        "|!>{0}", "|ει!>εῖ+{0}", "|η!>ῆ+{0}", "|ε!>έ+{0}",  # @@@
        "|σ>σα+{0}",
        "|ξ>ξα+{0}", "|ψ>ψα+{0}",
        "|ρ>ρα+{0}", "|λ>λα+{0}",
    ]
)
