import re


def f(x):
    if x == "":
        return "", ""
    m = re.search(r"\|([^>]+)>", x)
    if m:
        stem_ending = m.group(1)
    else:
        stem_ending = None
    x = re.sub(r"\|[^>]+>", "", x)
    x = re.sub(r"<[^|]+\|", "", x)
    x = re.sub(r"\+", "", x)
    return x, stem_ending


PRIMARY_ACTIVE = {
    "1S": [
        f("ω"), f("|ά>ῶ<ω|"), f("|έ>ῶ<ω|"), f("|ό>ῶ<ω|"), f("|#>ῶ<ω|"),
        f("|!>μι"), f("|α!>η+μι"), f("|ε!>η+μι"), f("|ο!>ω+μι"),
    ],
    "2S": [
        f("εις"), f("|ά>ᾷ<ει|ς"), f("|έ>εῖ<ει|ς"), f("|ό>οῖ<ει|ς"), f("|#>εῖ<ει|ς"),
        f("|η>ῃ<ι|ς"),
        f("|!>ς"), f("|α!>η+ς"), f("|ε!>η+ς"), f("|ο!>ω+ς"),
    ],
    "3S": [
        f("ει"), f("|ά>ᾷ<ει|"), f("|έ>εῖ<ει|"), f("|ό>οῖ<ει|"), f("|#>εῖ<ει|"), f("|η>ῃ<ι|"),
        f("|!>σι(ν)"), f("|α!>η+σι(ν)"), f("|ε!>η+σι(ν)"), f("|ο!>ω+σι(ν)"),
        f("|!>τι(ν)"),
    ],
    "1P": [
        f("ο+μεν"), f("|ά>ῶ<ο|+μεν"), f("|έ>οῦ<ο|+μεν"), f("|ό>οῦ<ο|+μεν"), f("|#>οῦ<ο|+μεν"),
        f("|!>μεν"),
    ],
    "2P": [
        f("ε+τε"), f("|ά>ᾶ<ε|+τε"), f("|ή>ῆ<ε|+τε"), f("|έ>εῖ<ε|+τε"), f("|ό>οῦ<ε|+τε"), f("|#>εῖ<ε|+τε"),
        f("|!>τε"),
    ],
    "3P": [
        f("ου+σι(ν)"), f("|ά>ῶ<ου|+σι(ν)"), f("|έ>οῦ<ου|+σι(ν)"), f("|ό>οῦ<ου|+σι(ν)"), f("|#>οῦ<ου|+σι(ν)"),
        f("|!>ασι(ν)"), f("|α!>ᾶ<α|σι(ν)"), f("|ε!>ᾶ<α|σι(ν)"),
    ],
}

PRIMARY_MIDDLE = {
    "1S": [
        f("ο+μαι"), f("|ά>ῶ<ο|+μαι"), f("|έ>οῦ<ο|+μαι"), f("|έ>έο<ο|+μαι"), f("|ό>οῦ<ο|+μαι"),
        f("|!>μαι"),
    ],
    "2S": [
        f("ει"), f("ῃ"), f("ε+σαι"), f("|ά>ᾷ<ει|"), f("|ά>ᾶ<ε|+σαι"), f("|έ>εῖ<ει|"), f("|έ>ῇ<ῃ|"), f("|ό>οῖ<ει|"),
        f("|!>σαι"), f("|α!>ῃ<ῃ|"), f("|η!>ῃ<ῃ|"),
    ],
    "3S": [
        f("ε+ται"), f("|ά>ᾶ<ε|+ται"), f("|έ>εῖ<ε|+ται"), f("|ό>οῦ<ε|+ται"), f("|#>εῖ<ε|+ται"),
        f("|!>ται"),
    ],
    "1P": [
        f("ό+μεθα"), f("|α>ώ<ό|+μεθα"), f("|ε>ού<ό|+μεθα"), f("|ο>ού<ό|+μεθα"),
        f("|!>μεθα"),
    ],
    "2P": [
        f("ε+σθε"), f("|ά>ᾶ<ε|+σθε"), f("|έ>εῖ<ε|+σθε"), f("|ό>οῦ<ε|+σθε"), f("|#>εῖ<ε|+σθε"),
        f("|!>σθε"),
    ],
    "3P": [
        f("ο+νται"), f("|ά>ῶ<ο|+νται"), f("|έ>οῦ<ο|+νται"), f("|ό>οῦ<ο|+νται"), f("|#>οῦ<ο|+νται"),
        f("|!>νται")
    ],
}

SECONDARY_ACTIVE = {
    "1S": [
        f("ο+ν"), f("|α>ω<ο|+ν"), f("|ε>ου<ο|+ν"), f("|ο>ου<ο|+ν"),
        f("|!>ν"), f("|α!>η+ν"), f("|ε!>ει+ν"), f("|ε!>η+ν"), f("|ο!>ου+ν")
    ],
    "2S": [
        f("ε+ς"), f("|α>ᾱ<ε|+ς"), f("|ε>ει<ε|+ς"), f("|ο>ου<ε|+ς"),
        f("|!>ς"), f("|α!>η+ς"), f("|ε!>ει+ς"), f("|ο!>ου+ς"),
    ],
    "3S": [
        f("ε"), f("ε(ν)"), f("|α>ᾱ<ε|"), f("|ε>ει<ε|"), f("|ο>ου<ε|"),
        f("|!>"), f("|α!>η"), f("|ε!>ει"), f("|ο!>ου"), f("|!>ν"),
    ],
    "1P": [
        f("ο+μεν"), f("|ά>ῶ<ο|+μεν"), f("|έ>οῦ<ο|+μεν"), f("|ό>οῦ<ο|+μεν"),
        f("|!>μεν"),
    ],
    "2P": [
        f("ε+τε"), f("|ά>ᾶ<ε|+τε"), f("|έ>εῖ<ε|+τε"), f("|ή>ῆ<ε|+τε"), f("|ό>οῦ<ε|+τε"),
        f("|!>τε"),
    ],
    "3P": [
        f("ο+ν"), f("|α>ω<ο|+ν"), f("|ε>ου<ο|+ν"), f("|ο>ου<ο|+ν"),
        f("ο+σαν"), f("|ό>οῦ<ε|+σαν"),
        f("|!>σαν"),
    ],
}

SECONDARY_MIDDLE = {
    "1S": [
        f("ό+μην"), f("|α>ώ<ό|+μην"), f("|ε>ού<ό|+μην"), f("|ο>ού<ό|+μην"),
        f("|!>μην"),
    ],
    "2S": [
        f("ου"), f("|ά>ῶ<ου|"), f("|έ>οῦ<ου|"), f("|ό>οῦ<ου|"),
        f("|!>σο"), f("|!>σθα"),
    ],
    "3S": [
        f("ε+το"), f("|ά>ᾶ<ε|+το"), f("|έ>εῖ<ε|+το"), f("|ό>οῦ<ε|+το"),
        f("|!>το")
    ],
    "1P": [
        f("ό+μεθα"), f("|α>ώ<ό|+μεθα"), f("|ε>ού<ό|+μεθα"), f("|ο>ού<ό|+μεθα"),
        f("|!>μεθα"),
    ],
    "2P": [
        f("ε+σθε"), f("|ά>ᾶ<ε|+σθε"), f("|έ>εῖ<ε|+σθε"), f("|ό>οῦ<ε|+σθε"),
        f("|!>σθε"),
    ],
    "3P": [
        f("ο+ντο"), f("|ά>ῶ<ο|+ντο"), f("|έ>οῦ<ο|+ντο"), f("|ό>οῦ<ο|+ντο"),
        f("|!>ντο"),
    ],
}


ACTIVE_SUBJUNCTIVE = {
    "1S": [
        f("ω"),
        f("|ά>ῶ"), f("|έ>ῶ"), f("|ό>ῶ"),
        f("|ό!>ῶ"), f("|έ!>ῶ"), f("|ά!>ῶ"),
    ],
    "2S": [
        f("ῃς"),
        f("|ά>ᾷς"), f("|έ>ῇς"), f("|ό>οῖς"),
        f("|ό!>ῷς"), f("|έ!>ῇς"), f("|ά!>ῇς"),
    ],
    "3S": [
        f("ῃ"),
        f("|ά>ᾷ"), f("|έ>ῇ"), f("|ό>οῖ"),
        f("|ό!>ῷ"), f("|έ!>ῇ"), f("|ά!>ῇ"),
    ],
    "1P": [
        f("ω+μεν"),
        f("|ά>ῶ+μεν"), f("|έ>ῶ+μεν"), f("|ό>ῶ+μεν"),
        f("|ό!>ῶ+μεν"), f("|έ!>ῶ+μεν"), f("|ά!>ῶ+μεν"),
    ],
    "2P": [
        f("η+τε"),
        f("|ά>ᾶ+τε"), f("|έ>ῆ+τε"), f("|ό>ῶ+τε"),
        f("|ό!>ῶ+τε"), f("|έ!>ῆ+τε"), f("|ά!>ῆ+τε"),
    ],
    "3P": [
        f("ω+σι(ν)"),
        f("|ά>ῶ+σι(ν)"), f("|έ>ῶ+σι(ν)"), f("|ό>ῶ+σι(ν)"),
        f("|ό!>ῶ+σι(ν)"), f("|έ!>ῶ+σι(ν)"), f("|ά!>ῶ+σι(ν)"),
    ],
}


MIDDLE_SUBJUNCTIVE = {
    "1S": [
        f("ω+μαι"),
        f("|ά>ῶ+μαι"), f("|έ>ῶ+μαι"), f("|ό>ῶ+μαι"),
        f("|ό!>ῶ+μαι"), f("|έ!>ῶ+μαι"), f("|ά!>ῶ+μαι"),
    ],
    "2S": [
        f("ῃ"),
        f("|ά>ᾷ"), f("|έ>ῇ"), f("|ό>οῖ"),
        f("|ό!>ῷ"), f("|έ!>ῇ"), f("|ά!>ῇ"),
    ],
    "3S": [
        f("η+ται"),
        f("|ά>ᾶ+ται"), f("|έ>ῆ+ται"), f("|ό>ῶ+ται"),
        f("|ό!>ῶ+ται"), f("|έ!>ῆ+ται"), f("|ά!>ῆ+ται"),
    ],
    "1P": [
        f("ω+μεθα"),
        f("|ά>ω+μεθα"), f("|έ>ω+μεθα"), f("|ό>ώ+μεθα"),
        f("|ό!>ώ+μεθα"), f("|έ!>ώ+μεθα"), f("|ά!>ώ+μεθα"),
    ],
    "2P": [
        f("η+σθε"),
        f("|ά>ᾶ+σθε"), f("|έ>ῆ+σθε"), f("|ό>ῶ+σθε"),
        f("|ό!>ῶ+σθε"), f("|έ!>ῆ+σθε"), f("|ά!>ῆ+σθε"),
    ],
    "3P": [
        f("ω+νται"),
        f("|ά>ῶ+νται"), f("|έ>ῶ+νται"), f("|ό>ῶ+νται"),
        f("|ό!>ῶ+νται"), f("|έ!>+ῶ+νται"), f("|ά!>ῶ+νται"),
    ],
}


ACTIVE_OPTATIVE = {
    "1S": [
        f("οι+μι"),
        f("|ά>ῷ+μι"), f("|έ>οῖ+μι"), f("|ό>οῖ+μι"),
        f("|ά>ῴη+ν"), f("|ε>οιη+ν"), f("|ο>οιη+ν"),
        f("|!>ιη+ν"),
    ],
    "2S": [
        f("οις"),
        f("|ά>ῷ+ς"), f("|έ>οῖ+ς"), f("|ό>οῖ+ς"),
        f("|ά>ῴη+ς"), f("|ε>οιη+ς"), f("|ο>οιη+ς"),
        f("|!>ιη+ς"),
    ],
    "3S": [
        f("οι"),
        f("|ά>ῷ"), f("|έ>οῖ"), f("|ό>οῖ"),
        f("|ά>ῴη"), f("|ε>οιη"), f("|ο>οιη"),
        f("|!>ιη"),
    ],
    "1P": [
        f("οι+μεν"),
        f("|ά>ῷ+μεν"), f("|έ>οῖ+μεν"), f("|ό>οῖ+μεν"),
        f("|ά>ῴη+μεν"), f("|έ>οιη+μεν"), f("|ο>οιη+μεν"),
        f("|!>ῖ+μεν"),
        f("|!>ιη+μεν"),
    ],
    "2P": [
        f("οι+τε"),
        f("|ά>ῷ+τε"), f("|έ>οῖ+τε"), f("|ό>οῖ+τε"),
        f("|ά>ῴη+τε"), f("|ε>οιη+τε"), f("|ο>οιη+τε"),
        f("|!>ῖ+τε"),
        f("|!>ιη+τε"),
    ],
    "3P": [
        f("οι+εν"),
        f("|ά>ῷ+εν"), f("|έ>οῖ+εν"), f("|ό>οῖ+εν"),
        f("|ά>ῴη+σαν"), f("|ε>οιη+σαν"), f("|ο>οιη+σαν"),
        f("|!>ῖ+εν"),
        f("|!>ιη+σαν"),
    ],
}


MIDDLE_OPTATIVE = {
    "1S": [
        f("οι+μην"),
        f("|ά>ῴ+μην"), f("|ε>οι+μην"), f("|ο>οι+μην"),
        f("|!>ι+μην"),
    ],
    "2S": [
        f("οιο"),
        f("|ά>ῷο"), f("|έ>οῖο"), f("|ό>οῖο"),
        f("|!>ῖο"),
    ],
    "3S": [
        f("οι+το"),
        f("|ά>ῷ+το"), f("|έ>οῖ+το"), f("|ό>οῖ+το"),
        f("|!>ῖ+το"),
    ],
    "1P": [
        f("οι+μεθα"),
        f("|ά>ῴ+μεθα"), f("|ε>οι+μεθα"), f("|ο>οι+μεθα"),
        f("|!>ι+μεθα"),
    ],
    "2P": [
        f("οι+σθε"),
        f("|ά>ῷ+σθε"), f("|έ>οῖ+σθε"), f("|ό>οῖ+σθε"),
        f("|!>ῖ+σθε"),
    ],
    "3P": [
        f("οι+ντο"),
        f("|ά>ῷ+ντο"), f("|έ>οῖ+ντο"), f("|ό>οῖ+ντο"),
        f("|!>ῖ+ντο"),
    ],
}


PRIMARY_ACTIVE_IMPERATIVE = {
    "2S": [
        f("ε"),
        f("|α>ᾱ"), f("|ε>ει"), f("|ο>ου"),
        f("|ο!>ου"), f("|ε!>ει"), f("|α!>η"), f("|ῡ!>ῡ"),
    ],
    "3S": [
        f("ε+τω"),
        f("|α>α+τω"), f("|ε>ει+τω"), f("|ο>ου+τω"),
        f("|!>+τω"),
    ],
    "2P": [
        f("ε+τε"),
        f("|α>ᾶ+τε"), f("|ε>εῖ+τε"), f("|ο>οῦ+τε"),
        f("|!>+τε"),
    ],
    "3P": [
        f("ο+ντων"),
        f("|α>ώ+ντων"), f("|ε>ου+ντων"), f("|ο>ου+ντων"),
        f("|!>+ντων"),
    ],
}

PRIMARY_MIDDLE_IMPERATIVE = {
    "2S": [
        f("ου"),
        f("|α>ῶ"), f("|ε>οῦ"), f("|ο>οῦ"),
        f("|!>+σο"),
    ],
    "3S": [
        f("ε+σθω"),
        f("|α>α+σθω"), f("|ε>ει+σθω"), f("|ο>ου+σθω"),
        f("|!>+σθω"),
    ],
    "2P": [
        f("ε+σθε"),
        f("|α>ᾶ+σθε"), f("|ε>εῖ+σθε"), f("|ο>οῦ+σθε"),
        f("|!>+σθε"),
    ],
    "3P": [
        f("ε+σθων"),
        f("|α>α+σθων"), f("|ε>ει+σθων"), f("|ο>ου+σθων"),
        f("|!>+σθων"),
    ],
}


ACTIVE_INFINITIVE = [
    f("ειν"),
    f("|ά>ᾶν"), f("|έ>εῖν"), f("|ό>οῦν"),
    f("|ό!>όναι"), f("|έ!>έναι"), f("|ά!>άναι"), f("|ῡ!>ύναι"),
]


MIDDLE_INFINITIVE = [
    f("ε+σθαι"),
    f("|ά>ᾶσθαι"), f("|έ>εῖ+σθαι"), f("|ό>οῦ+σθαι"),
    f("|!>σθαι"),
]
